//** Задача 6 :**
//Ще казваме, че поредица от числа е трион, ако всяко число в нея е едновременно по-голямо или равно 
// от двата си съседа или пък едновременно по - малко или равно от тях.
// 
//За първия и последния елемент имаме само по един съсед.
//Напишете програма, която въвежда от стандартния 5 на брой цели числа.
//Да се изведе на стандартния изход "yes", ако въведената поредица е трион, или "no", в противен случай.

//#include <iostream>
//
//using namespace std;
//
//int main()
//{
//	int n1, n2, n3, n4, n5;
//
//	cout << "Enter 5 integers: \n";
//	cin >> n1 >> n2 >> n3 >> n4 >> n5;
//
//	if (
//		((n2 >= n3 && n2 >= n1) || (n2 <= n3 && n2 <= n1)) &&
//		((n3 >= n2 && n3 >= n4) || (n3 <= n2 && n3 <= n4)) &&
//		((n4 >= n3 && n4 >= n5) || (n4 <= n3 && n4 <= n5))
//		)
//	{
//		cout << "yes\n";
//	}
//	else
//	{
//		cout << "no\n";
//	}
//}